Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/fuses.h
#define FUSES_DEVCFG1_WDTPSS_PSS65536         (FUSES_DEVCFG1_WDTPSS_PSS65536_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:65536 Position */
#define FUSES_DEVCFG1_WDTPSS_PSS131072        (FUSES_DEVCFG1_WDTPSS_PSS131072_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:131072 Position */
#define FUSES_DEVCFG1_WDTPSS_PSS262144        (FUSES_DEVCFG1_WDTPSS_PSS262144_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:262144 Position */
#define FUSES_DEVCFG1_WDTPSS_PSS524288        (FUSES_DEVCFG1_WDTPSS_PSS524288_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:524288 Position */
#define FUSES_DEVCFG1_WDTPSS_PSS1048576       (FUSES_DEVCFG1_WDTPSS_PSS1048576_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1048576 Position */
#define FUSES_DEVCFG1_QSPIDDRM_Pos            _UINT32_(29)                                         /* (FUSES_DEVCFG1) QSPI DDR Mode Clock Enable Position */
#define FUSES_DEVCFG1_QSPIDDRM_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_QSPIDDRM_Pos)        /* (FUSES_DEVCFG1) QSPI DDR Mode Clock Enable Mask */
#define FUSES_DEVCFG1_QSPIDDRM(value)         (FUSES_DEVCFG1_QSPIDDRM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSPIDDRM_Pos)) /* Assignment of value for QSPIDDRM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSPIDDRM_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSPIDDRM_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSPIDDRM_ON             (FUSES_DEVCFG1_QSPIDDRM_ON_Val << FUSES_DEVCFG1_QSPIDDRM_Pos) /* (FUSES_DEVCFG1)  Position */
#define FUSES_DEVCFG1_QSPIDDRM_OFF            (FUSES_DEVCFG1_QSPIDDRM_OFF_Val << FUSES_DEVCFG1_QSPIDDRM_Pos) /* (FUSES_DEVCFG1)  Position */
#define FUSES_DEVCFG1_CLKZBREF_Pos            _UINT32_(30)                                         /* (FUSES_DEVCFG1) External Reference Clock ZB Enable Position */
#define FUSES_DEVCFG1_CLKZBREF_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_CLKZBREF_Pos)        /* (FUSES_DEVCFG1) External Reference Clock ZB Enable Mask */
#define FUSES_DEVCFG1_CLKZBREF(value)         (FUSES_DEVCFG1_CLKZBREF_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CLKZBREF_Pos)) /* Assignment of value for CLKZBREF in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CLKZBREF_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CLKZBREF_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CLKZBREF_ON             (FUSES_DEVCFG1_CLKZBREF_ON_Val << FUSES_DEVCFG1_CLKZBREF_Pos) /* (FUSES_DEVCFG1)  Position */
#define FUSES_DEVCFG1_CLKZBREF_OFF            (FUSES_DEVCFG1_CLKZBREF_OFF_Val << FUSES_DEVCFG1_CLKZBREF_Pos) /* (FUSES_DEVCFG1)  Position */
#define FUSES_DEVCFG1_CAN1_PIN_EN_Pos         _UINT32_(31)                                         /* (FUSES_DEVCFG1) CAN1 Pin Enable Position */
#define FUSES_DEVCFG1_CAN1_PIN_EN_Msk         (_UINT32_(0x1) << FUSES_DEVCFG1_CAN1_PIN_EN_Pos)     /* (FUSES_DEVCFG1) CAN1 Pin Enable Mask */
#define FUSES_DEVCFG1_CAN1_PIN_EN(value)      (FUSES_DEVCFG1_CAN1_PIN_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CAN1_PIN_EN_Pos)) /* Assignment of value for CAN1_PIN_EN in the FUSES_DEVCFG1 register */
#define FUSES_DEVCFG1_Msk                     _UINT32_(0xFFFFFFE4)                                 /* (FUSES_DEVCFG1) Register Mask  */


/* -------- FUSES_DEVCFG0 : (FUSES Offset: 0x118) (R/W 32) USER Page CFGCON0 Fuses -------- */
#define FUSES_DEVCFG0_RESETVALUE              _UINT32_(0x7960000B)                                 /*  (FUSES_DEVCFG0) USER Page CFGCON0 Fuses  Reset Value */

#define FUSES_DEVCFG0_SWOEN_Pos               _UINT32_(1)                                          /* (FUSES_DEVCFG0) SWO enable on 2-wire debug interface Position */
#define FUSES_DEVCFG0_SWOEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_SWOEN_Pos)           /* (FUSES_DEVCFG0) SWO enable on 2-wire debug interface Mask */
#define FUSES_DEVCFG0_SWOEN(value)            (FUSES_DEVCFG0_SWOEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SWOEN_Pos)) /* Assignment of value for SWOEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SWOEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SWOEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SWOEN_OFF               (FUSES_DEVCFG0_SWOEN_OFF_Val << FUSES_DEVCFG0_SWOEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_SWOEN_ON                (FUSES_DEVCFG0_SWOEN_ON_Val << FUSES_DEVCFG0_SWOEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_TROEN_Pos               _UINT32_(2)                                          /* (FUSES_DEVCFG0) Trace Output Enable Position */
#define FUSES_DEVCFG0_TROEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_TROEN_Pos)           /* (FUSES_DEVCFG0) Trace Output Enable Mask */
#define FUSES_DEVCFG0_TROEN(value)            (FUSES_DEVCFG0_TROEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_TROEN_Pos)) /* Assignment of value for TROEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_TROEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_TROEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_TROEN_OFF               (FUSES_DEVCFG0_TROEN_OFF_Val << FUSES_DEVCFG0_TROEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_TROEN_ON                (FUSES_DEVCFG0_TROEN_ON_Val << FUSES_DEVCFG0_TROEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_ADCPOVR_Pos             _UINT32_(4)                                          /* (FUSES_DEVCFG0) ADC Charge Pump Override Position */
#define FUSES_DEVCFG0_ADCPOVR_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_ADCPOVR_Pos)         /* (FUSES_DEVCFG0) ADC Charge Pump Override Mask */
#define FUSES_DEVCFG0_ADCPOVR(value)          (FUSES_DEVCFG0_ADCPOVR_Msk & (_UINT32_(value) << FUSES_DEVCFG0_ADCPOVR_Pos)) /* Assignment of value for ADCPOVR in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_ADCPOVR_HW_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_ADCPOVR_SW_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_ADCPOVR_HW              (FUSES_DEVCFG0_ADCPOVR_HW_Val << FUSES_DEVCFG0_ADCPOVR_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_ADCPOVR_SW              (FUSES_DEVCFG0_ADCPOVR_SW_Val << FUSES_DEVCFG0_ADCPOVR_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_CPENFILT_Pos            _UINT32_(7)                                          /* (FUSES_DEVCFG0) ADC CP Filter Enable Position */
#define FUSES_DEVCFG0_CPENFILT_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_CPENFILT_Pos)        /* (FUSES_DEVCFG0) ADC CP Filter Enable Mask */
#define FUSES_DEVCFG0_CPENFILT(value)         (FUSES_DEVCFG0_CPENFILT_Msk & (_UINT32_(value) << FUSES_DEVCFG0_CPENFILT_Pos)) /* Assignment of value for CPENFILT in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_CPENFILT_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_CPENFILT_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_CPENFILT_OFF            (FUSES_DEVCFG0_CPENFILT_OFF_Val << FUSES_DEVCFG0_CPENFILT_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_CPENFILT_ON             (FUSES_DEVCFG0_CPENFILT_ON_Val << FUSES_DEVCFG0_CPENFILT_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_Pos        _UINT32_(8)                                          /* (FUSES_DEVCFG0) RTCIN0 Alternate Enable Position */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_Msk        (_UINT32_(0x1) << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos)    /* (FUSES_DEVCFG0) RTCIN0 Alternate Enable Mask */
#define FUSES_DEVCFG0_RTCIN0_ALTEN(value)     (FUSES_DEVCFG0_RTCIN0_ALTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos)) /* Assignment of value for RTCIN0_ALTEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_RTCIN0_ALTEN_PA3_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_RTCIN0_ALTEN_PA9_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_PA3        (FUSES_DEVCFG0_RTCIN0_ALTEN_PA3_Val << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_PA9        (FUSES_DEVCFG0_RTCIN0_ALTEN_PA9_Val << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_Pos        _UINT32_(9)                                          /* (FUSES_DEVCFG0) RTCOUT Alternate Enable Position */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_Msk        (_UINT32_(0x1) << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos)    /* (FUSES_DEVCFG0) RTCOUT Alternate Enable Mask */
#define FUSES_DEVCFG0_RTCOUT_ALTEN(value)     (FUSES_DEVCFG0_RTCOUT_ALTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos)) /* Assignment of value for RTCOUT_ALTEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_RTCOUT_ALTEN_PA4_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_RTCOUT_ALTEN_PA10_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_PA4        (FUSES_DEVCFG0_RTCOUT_ALTEN_PA4_Val << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_PA10       (FUSES_DEVCFG0_RTCOUT_ALTEN_PA10_Val << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_USBSSEN_Pos             _UINT32_(17)                                         /* (FUSES_DEVCFG0) USB Suspend Sleep Enable Position */
#define FUSES_DEVCFG0_USBSSEN_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_USBSSEN_Pos)         /* (FUSES_DEVCFG0) USB Suspend Sleep Enable Mask */
#define FUSES_DEVCFG0_USBSSEN(value)          (FUSES_DEVCFG0_USBSSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_USBSSEN_Pos)) /* Assignment of value for USBSSEN in the FUSES_DEVCFG0 register */
#define FUSES_DEVCFG0_EPLLHWMD_Pos            _UINT32_(18)                                         /* (FUSES_DEVCFG0) EWPLL HW Control Mode for PWDN and RESET Position */
#define FUSES_DEVCFG0_EPLLHWMD_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_EPLLHWMD_Pos)        /* (FUSES_DEVCFG0) EWPLL HW Control Mode for PWDN and RESET Mask */
#define FUSES_DEVCFG0_EPLLHWMD(value)         (FUSES_DEVCFG0_EPLLHWMD_Msk & (_UINT32_(value) << FUSES_DEVCFG0_EPLLHWMD_Pos)) /* Assignment of value for EPLLHWMD in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_EPLLHWMD_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_EPLLHWMD_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_EPLLHWMD_OFF            (FUSES_DEVCFG0_EPLLHWMD_OFF_Val << FUSES_DEVCFG0_EPLLHWMD_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_EPLLHWMD_ON             (FUSES_DEVCFG0_EPLLHWMD_ON_Val << FUSES_DEVCFG0_EPLLHWMD_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_UPLLHWMD_Pos            _UINT32_(19)                                         /* (FUSES_DEVCFG0) UWPLL HW Control Mode for PWDN and RESET Position */
#define FUSES_DEVCFG0_UPLLHWMD_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_UPLLHWMD_Pos)        /* (FUSES_DEVCFG0) UWPLL HW Control Mode for PWDN and RESET Mask */
#define FUSES_DEVCFG0_UPLLHWMD(value)         (FUSES_DEVCFG0_UPLLHWMD_Msk & (_UINT32_(value) << FUSES_DEVCFG0_UPLLHWMD_Pos)) /* Assignment of value for UPLLHWMD in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_UPLLHWMD_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_UPLLHWMD_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_UPLLHWMD_OFF            (FUSES_DEVCFG0_UPLLHWMD_OFF_Val << FUSES_DEVCFG0_UPLLHWMD_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_UPLLHWMD_ON             (FUSES_DEVCFG0_UPLLHWMD_ON_Val << FUSES_DEVCFG0_UPLLHWMD_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_HPLUGDIS_Pos            _UINT32_(20)                                         /* (FUSES_DEVCFG0) Hot Plugging Disable Position */
#define FUSES_DEVCFG0_HPLUGDIS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_HPLUGDIS_Pos)        /* (FUSES_DEVCFG0) Hot Plugging Disable Mask */
#define FUSES_DEVCFG0_HPLUGDIS(value)         (FUSES_DEVCFG0_HPLUGDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG0_HPLUGDIS_Pos)) /* Assignment of value for HPLUGDIS in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_HPLUGDIS_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_HPLUGDIS_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_HPLUGDIS_OFF            (FUSES_DEVCFG0_HPLUGDIS_OFF_Val << FUSES_DEVCFG0_HPLUGDIS_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_HPLUGDIS_ON             (FUSES_DEVCFG0_HPLUGDIS_ON_Val << FUSES_DEVCFG0_HPLUGDIS_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_USBIDIO_Pos             _UINT32_(21)                                         /* (FUSES_DEVCFG0) USB USBID Selection bit Position */
#define FUSES_DEVCFG0_USBIDIO_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_USBIDIO_Pos)         /* (FUSES_DEVCFG0) USB USBID Selection bit Mask */
#define FUSES_DEVCFG0_USBIDIO(value)          (FUSES_DEVCFG0_USBIDIO_Msk & (_UINT32_(value) << FUSES_DEVCFG0_USBIDIO_Pos)) /* Assignment of value for USBIDIO in the FUSES_DEVCFG0 register */
#define FUSES_DEVCFG0_VBUSONIO_Pos            _UINT32_(22)                                         /* (FUSES_DEVCFG0) USB VBUS_ON Selection bit Position */
#define FUSES_DEVCFG0_VBUSONIO_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_VBUSONIO_Pos)        /* (FUSES_DEVCFG0) USB VBUS_ON Selection bit Mask */
#define FUSES_DEVCFG0_VBUSONIO(value)         (FUSES_DEVCFG0_VBUSONIO_Msk & (_UINT32_(value) << FUSES_DEVCFG0_VBUSONIO_Pos)) /* Assignment of value for VBUSONIO in the FUSES_DEVCFG0 register */
#define FUSES_DEVCFG0_SMBUS3EN2_Pos           _UINT32_(23)                                         /* (FUSES_DEVCFG0) SMBus3 Enable for SERCOM2 Position */
#define FUSES_DEVCFG0_SMBUS3EN2_Msk           (_UINT32_(0x1) << FUSES_DEVCFG0_SMBUS3EN2_Pos)       /* (FUSES_DEVCFG0) SMBus3 Enable for SERCOM2 Mask */
#define FUSES_DEVCFG0_SMBUS3EN2(value)        (FUSES_DEVCFG0_SMBUS3EN2_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUS3EN2_Pos)) /* Assignment of value for SMBUS3EN2 in the FUSES_DEVCFG0 register */
#define FUSES_DEVCFG0_PCM_Pos                 _UINT32_(24)                                         /* (FUSES_DEVCFG0) PCHE I/D Cacheable Mode Position */
#define FUSES_DEVCFG0_PCM_Msk                 (_UINT32_(0x1) << FUSES_DEVCFG0_PCM_Pos)             /* (FUSES_DEVCFG0) PCHE I/D Cacheable Mode Mask */
#define FUSES_DEVCFG0_PCM(value)              (FUSES_DEVCFG0_PCM_Msk & (_UINT32_(value) << FUSES_DEVCFG0_PCM_Pos)) /* Assignment of value for PCM in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_PCM_CPU_Val           _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_PCM_SFR_Val           _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_PCM_CPU                 (FUSES_DEVCFG0_PCM_CPU_Val << FUSES_DEVCFG0_PCM_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_PCM_SFR                 (FUSES_DEVCFG0_PCM_SFR_Val << FUSES_DEVCFG0_PCM_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_INT0E_Pos               _UINT32_(25)                                         /* (FUSES_DEVCFG0) INT0 Enable Position */
#define FUSES_DEVCFG0_INT0E_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_INT0E_Pos)           /* (FUSES_DEVCFG0) INT0 Enable Mask */
#define FUSES_DEVCFG0_INT0E(value)            (FUSES_DEVCFG0_INT0E_Msk & (_UINT32_(value) << FUSES_DEVCFG0_INT0E_Pos)) /* Assignment of value for INT0E in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_INT0E_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_INT0E_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_INT0E_OFF               (FUSES_DEVCFG0_INT0E_OFF_Val << FUSES_DEVCFG0_INT0E_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_INT0E_ON                (FUSES_DEVCFG0_INT0E_ON_Val << FUSES_DEVCFG0_INT0E_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_INT0P_Pos               _UINT32_(26)                                         /* (FUSES_DEVCFG0) INT0P Polarity Position */
#define FUSES_DEVCFG0_INT0P_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_INT0P_Pos)           /* (FUSES_DEVCFG0) INT0P Polarity Mask */
#define FUSES_DEVCFG0_INT0P(value)            (FUSES_DEVCFG0_INT0P_Msk & (_UINT32_(value) << FUSES_DEVCFG0_INT0P_Pos)) /* Assignment of value for INT0P in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_INT0P_NEG_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_INT0P_POS_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_INT0P_NEG               (FUSES_DEVCFG0_INT0P_NEG_Val << FUSES_DEVCFG0_INT0P_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_INT0P_POS               (FUSES_DEVCFG0_INT0P_POS_Val << FUSES_DEVCFG0_INT0P_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_CMEN_Pos                _UINT32_(27)                                         /* (FUSES_DEVCFG0) SPA/DPA Countermeasures Enable Position */
#define FUSES_DEVCFG0_CMEN_Msk                (_UINT32_(0x1) << FUSES_DEVCFG0_CMEN_Pos)            /* (FUSES_DEVCFG0) SPA/DPA Countermeasures Enable Mask */
#define FUSES_DEVCFG0_CMEN(value)             (FUSES_DEVCFG0_CMEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_CMEN_Pos)) /* Assignment of value for CMEN in the FUSES_DEVCFG0 register */
#define FUSES_DEVCFG0_FECCCON_Pos             _UINT32_(28)                                         /* (FUSES_DEVCFG0) Flash ECC Control Position */
#define FUSES_DEVCFG0_FECCCON_Msk             (_UINT32_(0x3) << FUSES_DEVCFG0_FECCCON_Pos)         /* (FUSES_DEVCFG0) Flash ECC Control Mask */
#define FUSES_DEVCFG0_FECCCON(value)          (FUSES_DEVCFG0_FECCCON_Msk & (_UINT32_(value) << FUSES_DEVCFG0_FECCCON_Pos)) /* Assignment of value for FECCCON in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_FECCCON_ON_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FECCCON_DYNAMIC_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FECCCON_OFF_Val       _UINT32_(0x3)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_FECCCON_ON              (FUSES_DEVCFG0_FECCCON_ON_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_FECCCON_DYNAMIC         (FUSES_DEVCFG0_FECCCON_DYNAMIC_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_FECCCON_OFF             (FUSES_DEVCFG0_FECCCON_OFF_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_FRECCDIS_Pos            _UINT32_(30)                                         /* (FUSES_DEVCFG0) Flex RAM ECC Control Position */
#define FUSES_DEVCFG0_FRECCDIS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_FRECCDIS_Pos)        /* (FUSES_DEVCFG0) Flex RAM ECC Control Mask */
#define FUSES_DEVCFG0_FRECCDIS(value)         (FUSES_DEVCFG0_FRECCDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG0_FRECCDIS_Pos)) /* Assignment of value for FRECCDIS in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_FRECCDIS_OFF_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FRECCDIS_ON_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_FRECCDIS_OFF            (FUSES_DEVCFG0_FRECCDIS_OFF_Val << FUSES_DEVCFG0_FRECCDIS_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_FRECCDIS_ON             (FUSES_DEVCFG0_FRECCDIS_ON_Val << FUSES_DEVCFG0_FRECCDIS_Pos) /* (FUSES_DEVCFG0)  Position */
#define FUSES_DEVCFG0_Msk                     _UINT32_(0x7FFE0396)                                 /* (FUSES_DEVCFG0) Register Mask  */

#define FUSES_DEVCFG0_SMBUS3EN_Pos            _UINT32_(23)                                         /* (FUSES_DEVCFG0 Position) SMBus3 Enable for SERCOM2 */
#define FUSES_DEVCFG0_SMBUS3EN_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_SMBUS3EN_Pos)        /* (FUSES_DEVCFG0 Mask) SMBUS3EN */
#define FUSES_DEVCFG0_SMBUS3EN(value)         (FUSES_DEVCFG0_SMBUS3EN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUS3EN_Pos)) 

/* -------- FUSES_FBCFG0 : (FUSES Offset: 0x11C) (R/W 32) NVR BCFG User Configuration Area -------- */
#define FUSES_FBCFG0_RESETVALUE               _UINT32_(0x00)                                       /*  (FUSES_FBCFG0) NVR BCFG User Configuration Area  Reset Value */

