Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/fuses.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FUSES_DEVICECFG register API structure */
typedef struct
{
  __IO  uint32_t                       FUSES_ALTFBCFG7;    /* Offset: 0x00 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_ALTFBCFG6;    /* Offset: 0x04 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_ALTFUSERID;   /* Offset: 0x08 (R/W  32) ALT USERID */
  __IO  uint32_t                       FUSES_ALTDEVCFG4;   /* Offset: 0x0C (R/W  32) ALT CFGCON4 Fuses */
  __IO  uint32_t                       FUSES_ALTDEVCFG2;   /* Offset: 0x10 (R/W  32) ALT CFGCON2 Fuses */
  __IO  uint32_t                       FUSES_ALTDEVCFG1;   /* Offset: 0x14 (R/W  32) ALT CFGCON1 Fuses */
  __IO  uint32_t                       FUSES_ALTDEVCFG0;   /* Offset: 0x18 (R/W  32) ALT CFGCON0 Fuses */
  __IO  uint32_t                       FUSES_ALTFBCFG0;    /* Offset: 0x1C (R/W  32) ALT NVR BCFG0 */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       FUSES_ALTFCPN3;     /* Offset: 0x30 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_ALTFCPN2;     /* Offset: 0x34 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_ALTFCPN1;     /* Offset: 0x38 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_ALTFCPN0;     /* Offset: 0x3C (R/W  32) ALT NVR CPN Register */
  __I   uint8_t                        Reserved2[0xC0];
  __IO  uint32_t                       FUSES_FBCFG7;       /* Offset: 0x100 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_FBCFG6;       /* Offset: 0x104 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_FUSERID;      /* Offset: 0x108 (R/W  32) USER Page USERID */
  __IO  uint32_t                       FUSES_DEVCFG4;      /* Offset: 0x10C (R/W  32) USER Page CFGCON4 Fuses */
  __IO  uint32_t                       FUSES_DEVCFG2;      /* Offset: 0x110 (R/W  32) USER Page CFGCON2 Fuses */
  __IO  uint32_t                       FUSES_DEVCFG1;      /* Offset: 0x114 (R/W  32) USER Page CFGCON1 Fuses */
  __IO  uint32_t                       FUSES_DEVCFG0;      /* Offset: 0x118 (R/W  32) USER Page CFGCON0 Fuses */
  __IO  uint32_t                       FUSES_FBCFG0;       /* Offset: 0x11C (R/W  32) NVR BCFG User Configuration Area */
  __I   uint8_t                        Reserved3[0x10];
  __IO  uint32_t                       FUSES_FCPN3;        /* Offset: 0x130 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_FCPN2;        /* Offset: 0x134 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_FCPN1;        /* Offset: 0x138 (R/W  32) RESERVED */
  __IO  uint32_t                       FUSES_FCPN0;        /* Offset: 0x13C (R/W  32) NVR CPN Register */
} fuses_devicecfg_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_FUSES_COMPONENT_H_ */
